#+TITLE: Deploy scQTL browser
#+AUTHOR: Abhishek Sarkar
#+PROPERTY: header-args:shell+ :eval never-export :results output drawer

Start a remote session on ~shiny.stephenslab.uchicago.edu~.

#+BEGIN_SRC sh :session shiny
  ssh shiny
#+END_SRC

The version of ~vagrant~ on ~shiny.stephenslab.uchicago.edu~ is old, and
appears to use a broken URL to download Vagrant boxes. Add the Debian Stretch
box using the full URL.

#+BEGIN_SRC sh :session shiny
  vagrant box add "https://app.vagrantup.com/debian/boxes/stretch64"
#+END_SRC

Start the VM.

#+BEGIN_SRC sh :session shiny :results output
  mkdir -p scqtl-browser
  cd scqtl-browser
  vagrant up
#+END_SRC

#+RESULTS:
#+begin_example

aksarkar@shiny:~/scqtl-browser$ [0mBringing machine 'default' up with 'virtualbox' provider...[0m
default: Checking if box 'debian/stretch64' is up to date...[0m
default: Clearing any previously set forwarded ports...[0m
default: Clearing any previously set network interfaces...[0m
default: Preparing network interfaces based on configuration...[0m
[0m    default: Adapter 1: nat[0m
default: Forwarding ports...[0m
5006 (host) (adapter 1)[0m
2222 (host) (adapter 1)[0m
default: Running 'pre-boot' VM customizations...[0m
default: Booting VM...[0m
default: Waiting for machine to boot. This may take a few minutes...[0m
[0m    default: SSH address: 127.0.0.1:2222[0m
[0m    default: SSH username: vagrant[0m
[0m    default: SSH auth method: private key[0m
default: Machine booted and ready![0m
default: Checking for guest additions in VM...[0m
[0m    default: No guest additions were detected on the base box for this VM! Guest
    default: additions are required for forwarded ports, shared folders, host only
    default: networking, and more. If SSH fails on this machine, please install
    default: the guest additions and repackage the box to continue.
    default: 
    default: This is not an error message; everything may continue to work properly,
    default: in which case you may ignore this message.[0m
default: Rsyncing folder: /home/aksarkar/scqtl-browser/ => /vagrant[0m
default: Machine already provisioned. Run `vagrant provision` or use the `--provision`
default: flag to force provisioning. Provisioners marked to run always will still run.[0m
[0m[0m
default: Machine 'default' has a post `vagrant up` message. This is a message
default: from the creator of the Vagrantfile, and not from Vagrant itself:
default:
default: Vanilla Debian box. See https://app.vagrantup.com/debian for help and bug reports[0m
#+end_example

ssh into the VM.

#+BEGIN_SRC sh :session shiny :results output
  vagrant ssh
#+END_SRC

#+RESULTS:
#+begin_example

1 SMP Debian 4.9.82-1+deb9u3 (2018-03-02) x86_64

The programs included with the Debian GNU/Linux system are free software;
the exact distribution terms for each program are described in the
individual files in /usr/share/doc/*/copyright.

Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
permitted by applicable law.
Last login: Fri Mar 30 15:29:18 2018 from 10.0.2.2
#+end_example

The data are available on the VM under ~/vagrant~. Fake the location of the
database as it appears on the test server (~*.midway2.rcc.uchicago.edu~).

#+BEGIN_SRC sh :session shiny
  sudo mkdir -p /project2/mstephens/aksarkar/projects/singlecell-qtl/
  sudo ln -s /vagrant /project2/mstephens/aksarkar/projects/singlecell-qtl/browser
#+END_SRC

Install ~miniconda3~ as user ~vagrant~.

#+BEGIN_SRC sh :session shiny
  wget -q https://repo.continuum.io/miniconda/Miniconda3-latest-Linux-x86_64.sh
  bash Miniconda3-latest-Linux-x86_64.sh -p
  echo "export PATH=$PATH:$HOME/miniconda3/bin" >>$HOME/.bashrc
  . $HOME/.bashrc
#+END_SRC

Initialize a new environment. We don't need the full environment from
~singlecell-qtl~.

#+BEGIN_SRC sh :session shiny
  conda env create -n "scqtl-browser" numpy scipy pandas matplotlib bokeh
  source activate scqtl-browser
#+END_SRC

~rsync~ the code and data to the server.

#+BEGIN_SRC sh
  sbatch --partition=broadwl
  #!/bin/bash
  rsync -au /project2/mstephens/aksarkar/projects/singlecell-qtl/browser/ shiny:scqtl-browser/
#+END_SRC

#+RESULTS:
: Submitted batch job 44693435

Start the QTL browser. The code/data are available under ~/vagrant~ inside the VM.

#+BEGIN_SRC sh :session shiny
  cd /vagrant
  source activate scqtl-browser
  bokeh serve fano-qtls --port 5006 --allow-websocket-origin=shiny.stephenslab.uchicago.edu:5006 &
#+END_SRC

#+RESULTS:
|                                                   |
| (scqtl-browser) vagrant@stretch:/vagrant$ [1] 623 |
